baseedt/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>String</types>
      <types>DocumentRef.СообщениеSMS</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

baseedt/src/Documents/РасходнаяНакладная/ManagerModule.bsl
Функция СформироватьРасходнуюНакладную(Ссылка) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РасходнаяНакладная.ПолучитьМакет("ПФ_MXL_Накладная");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Дата,
	|	РасходнаяНакладная.ЗаказКлиента.Представление КАК ПредставлениеЗаказа,
	|	РасходнаяНакладная.Контрагент.Представление КАК ПредставлениеПолучателя,
	|	РасходнаяНакладная.Номер,
	|	РасходнаяНакладная.Организация.Представление КАК ПредставлениеПоставщика,
	|	РасходнаяНакладная.Склад,
	|	РасходнаяНакладная.Событие,
	|	РасходнаяНакладная.Товары.(
	|		НомерСтроки,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура КАК Запас,
	|		Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
	ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
	
	ОбластьПредставлениеЗаказа = Макет.ПолучитьОбласть("Заказ");
	ОбластьСклад = Макет.ПолучитьОбласть("Склад");
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьТовары = Макет.ПолучитьОбласть("Строка");
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтоговаяСтрока = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
		
	СуммаИтого = 0;
	КоличествоПозиций = 0;
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(Новый Структура("ТекстЗаголовка", "Расходная накладная № "
														+ Выборка.Номер
														+ " от "
														+ Формат(Выборка.Дата, "ДЛФ=DD")));
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		ОбластьПоставщик.Параметры.Заполнить(Выборка);
		ОбластьПокупатель.Параметры.Заполнить(Выборка);
		
		ОбластьПредставлениеЗаказа.Параметры.Заполнить(Выборка);
		ОбластьСклад.Параметры.Заполнить(Выборка);
		
		ТабДок.Вывести(ОбластьПоставщик);
		ТабДок.Вывести(ОбластьПокупатель);
		
		ТабДок.Вывести(ОбластьПредставлениеЗаказа);
		ТабДок.Вывести(ОбластьСклад);
		
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			СуммаИтого = СуммаИтого + ВыборкаТовары.Сумма;
			КоличествоПозиций = КоличествоПозиций + 1;
		КонецЦикла;
		
		ОбластьИтого.Параметры.Заполнить(Новый Структура("Всего", СуммаИтого));
		
		ТабДок.Вывести(ОбластьИтого);
		
		СуммаПрописью = ЧислоПрописью(СуммаИтого) + " тенге";
		ИтоговаяСтрока = СтрШаблон("Всего наименование %1 на сумму %2 KZT (%3)",
							КоличествоПозиций, СуммаИтого, СуммаПрописью);
													
        ОбластьИтоговаяСтрока.Параметры.Заполнить(Новый Структура("ИтоговаяСтрока", ИтоговаяСтрока));
		
		ТабДок.Вывести(ОбластьИтоговаяСтрока);
		ТабДок.Вывести(ОбластьПодписи); 
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
